<a href="https://colab.research.google.com/github/olkasadova/data-and-python/blob/main/Data_Analysis_Worksheets/Sorting_and_cleaning.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Sorting and cleaning
---



In order to effectively analyse a dataset, often we need to prepare it first.
Before a dataset is ready to be analysed we might need to:  

* sort the data (can be a series or dataframe)  
* remove any NaN values or drop NA values   
* remove duplicate records (identical rows)  
* normalise data in dataframe columns so that has a common scale [reference](https://towardsai.net/p/data-science/how-when-and-why-should-you-normalize-standardize-rescale-your-data-3f083def38ff#:~:text=Similarly%2C%20the%20goal%20of%20normalization,dataset%20does%20not%20require%20normalization.&text=So%20we%20normalize%20the%20data,variables%20to%20the%20same%20range.)

## Sorting the data  
---


Typically we want to sort data by the values in one or more columns in the dataframe  

To sort the dataframe by series we use the pandas function **sort_values()**.  

By default `sort_values()` sorts into ascending order.

* sort by a single column e.g.
  * `df.sort_values("Make") `
* sort by multiple columns e.g.
  * `df.sort_values(by = ["Model", "Make"]) `
    * this sorts by Model, then my Make
* sort in *descending* order
  * `df.sort_values(by = "Make", ascending = False)`
  * `df.sort_values(by = ["Make", "Model"], ascending = False])`  

Dataframes are mostly immutable, changes like sort_values do not change the dataframe permanently, they just change it for the time that the instruction is being used.

`df.sort_values(by='Make')` *dataframe is now in sorted order and can be copied to a new dataframe*  
`df` *original dataframe, df, will be as it was - unsorted*

To split the dataframe after sorting, do this in the same instruction, e.g.:

`df.sort_values(by = ["Make", "Model"], ascending = False])[["Make", "Model"]]`

This sorts on Make and then Model in descending order, then splits off the Make and Model columns.

`df.sort_values(by = ["Make", "Model"], ascending = False])[["Make", "Model"]].head()`

This sorts on Make and then Model, then splits off the Make and Model columns and then splits off the first 5 rows.

### Exercise 1 - get data, sort by happiness score
---

Read data from the Excel file on Happiness Data at this link: https://github.com/futureCodersSE/working-with-data/blob/main/Happiness-Data/2015.xlsx?raw=true

Display first 5 rows of data  

The data is currently sorted by Happiness Rank...
*  sort the data by Happiness Score in ascending order
*  display sorted table

**Test output**:  
The lowest score (displayed first) is 2.839, Togo  
The highest score (displayed last) is 7.587, Switzerland

In [19]:
import pandas as pd
url = "https://github.com/futureCodersSE/working-with-data/blob/main/Happiness-Data/2015.xlsx?raw=true"
happiness = pd.read_excel(url)

sorted_list_Acs= happiness.sort_values("Happiness Score").head(5)
print ("The lowest score is: ", sorted_list_Acs ["Country"], ["Happiness Score"])

sorted_list_Des= happiness.sort_values(by= ["Happiness Score"], ascending = False).head(5)
print ("The highest score is: ", sorted_list_Des ["Country"], ["Happiness Score"])

The lowest score is:  157       Togo
156    Burundi
155      Syria
154      Benin
153     Rwanda
Name: Country, dtype: object ['Happiness Score']
The highest score is:  0    Switzerland
1        Iceland
2        Denmark
3         Norway
4         Canada
Name: Country, dtype: object ['Happiness Score']

### Exercise 2 - sort by multiple columns, display the first 5 rows
---

1. sort the data by Economy (GDP per Capita) and Health (Life Expectancy) in ascending order
2. display the first 5 rows of sorted data

**Test output**:  
Records 122, 127, 147, 100, 96

In [30]:
import pandas as pd
url = "https://github.com/futureCodersSE/working-with-data/blob/main/Happiness-Data/2015.xlsx?raw=true"
happiness = pd.read_excel(url)

sorted_Economy = happiness.sort_values (by= [ "Health (Life Expectancy)", "Economy (GDP per Capita)"],ascending = True).head(5)
print (sorted_Economy )

                      Country              Region  Happiness Rank  \
122              Sierra Leone  Sub-Saharan Africa             123
127                  Botswana  Sub-Saharan Africa             128
147  Central African Republic  Sub-Saharan Africa             148
100                 Swaziland  Sub-Saharan Africa             101
96                    Lesotho  Sub-Saharan Africa              97

     Happiness Score  Standard Error  Economy (GDP per Capita)   Family  \
122            4.507         0.07068                   0.33024  0.95571
127            4.332         0.04934                   0.99355  1.10464
147            3.678         0.06112                   0.07850  0.00000
100            4.867         0.08742                   0.71206  1.07284
96             4.898         0.09438                   0.37545  1.04103

     Health (Life Expectancy)  Freedom  Trust (Government Corruption)  \
122                   0.00000  0.40840                        0.08786
127                   0.04776  0.49495                        0.12474
147                   0.06699  0.48879                        0.08289
100                   0.07566  0.30658                        0.03060
96                    0.07612  0.31767                        0.12504

     Generosity  Dystopia Residual
122     0.21488            2.51009
127     0.10461            1.46181
147     0.23835            2.72230
100     0.18259            2.48676
96      0.16388            2.79832

### Exercise 3 - sorting in descending order
---

Sort the data by Freedom and Trust (Government Corruption) in descending order and show the Country and Region only for the last five rows

**Test output**:
136, 117, 95, 101, 111 Country and Region columns

In [35]:
import pandas as pd
url = "https://github.com/futureCodersSE/working-with-data/blob/main/Happiness-Data/2015.xlsx?raw=true"
happiness = pd.read_excel(url)

sorted_Trust = happiness.sort_values (by= [ "Freedom", "Trust (Government Corruption)"],ascending = False).tail(5)
print (sorted_Trust )

                    Country                           Region  Happiness Rank  \
136                  Angola               Sub-Saharan Africa             137
117                   Sudan               Sub-Saharan Africa             118
95   Bosnia and Herzegovina       Central and Eastern Europe              96
101                  Greece                   Western Europe             102
111                    Iraq  Middle East and Northern Africa             112

     Happiness Score  Standard Error  Economy (GDP per Capita)   Family  \
136            4.033         0.04758                   0.75778  0.86040
117            4.550         0.06740                   0.52107  1.01404
95             4.949         0.06913                   0.83223  0.91916
101            4.857         0.05062                   1.15406  0.92933
111            4.677         0.05232                   0.98549  0.81889

     Health (Life Expectancy)  Freedom  Trust (Government Corruption)  \
136                   0.16683  0.10384                        0.07122
117                   0.36878  0.10081                        0.14660
95                    0.79081  0.09245                        0.00227
101                   0.88213  0.07699                        0.01397
111                   0.60237  0.00000                        0.13788

     Generosity  Dystopia Residual
136     0.12344            1.94939
117     0.19062            2.20857
95      0.24808            2.06367
101     0.00000            1.80101
111     0.17922            1.95335

# Cleaning the data

Data comes from a range of sources:  forms, monitoring devices, etc.  There will often be missing values, duplicate records and values that are incorrectly formatted.  These can affect summary statistics and graphs plotted from the data.

Techniques for data cleansing include:
*  removing records with missing or null data (NaN, NA, "")
*  removing duplicate rows (keeping just one, either the first or the last)

Removal of rows according to criteria, or of columns are other ways that data might be cleaned up.

---

## Removing NaN/Dropping NA values

pandas have functions for checking a dataframe, or column, for null values, checking a column for missing values, and functions for dropping all rows that contain null values.

* check for NA/NaN/missing values across dataframe (returns True if NA values exist)  
  `df.isnull().values.any()`  

* check for NA/NaN/missing values in specific column  
  `df["Make"].isnull().values.any()`  

* drop all rows that have NA/NaN values   
  `df.dropna()`  

* drop rows where NA/NaN values exist in specific columns  
  `df.dropna(subset = ["Make", "Model"])`

### Exercise 4 - check for null values
---

1. read data from the file housing_in_london_yearly_variables.csv from this link: https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv
2. check if any NA values exist in the dataframe and print the result
3. use df.info() to see which columns have null entries (*Hint: if the non-null count is less than total entries, column contains missing/NA entries*)  

**Test output**:
True
.info shows median_salary, life_satisfaction, recycling_pct, population_size, number_of_jobs, area_size, no_of_houses all less than total rows (1071)

In [4]:
import pandas as pd
url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
df = pd.read_csv(url)

NA_result = df.isnull().values.any()
if NA_result == True:
  print ("some data is Null: ", NA_result)
else:
  print ("all dataframe has values", NA_result)

df.info()

some data is Null:  True
<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1071 entries, 0 to 1070
Data columns (total 12 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   code               1071 non-null   object
 1   area               1071 non-null   object
 2   date               1071 non-null   object
 3   median_salary      1049 non-null   float64
 4   life_satisfaction  352 non-null    float64
 5   mean_salary        1071 non-null   object
 6   recycling_pct      860 non-null    object
 7   population_size    1018 non-null   float64
 8   number_of_jobs     931 non-null    float64
 9   area_size          666 non-null    float64
 10  no_of_houses       666 non-null    float64
 11  borough_flag       1071 non-null   int64
dtypes: float64(6), int64(1), object(5)
memory usage: 100.5+ KB

### Exercise 5 - remove null values
---

1. remove rows with NA values for `life_satisfaction` (use [ ] even if only one column in list)
2. remove all NA values across whole dataframe

**Test output**:  
1.  Row count reduced to 352 rows
2.  Row count reduced to 267 rows

In [9]:
import pandas as pd
url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
df = pd.read_csv(url)

#remove rows with NA values for life_satisfaction (use [ ] even if only one column in list)
df.dropna (subset = ["life_satisfaction"])
print (df ["life_satisfaction"].count())

#remove all NA values across whole dataframe
df.dropna()
print (df.count())

352
code                 1071
area                 1071
date                 1071
median_salary        1049
life_satisfaction     352
mean_salary          1071
recycling_pct         860
population_size      1018
number_of_jobs        931
area_size             666
no_of_houses          666
borough_flag         1071
dtype: int64

## Dropping duplicates
---

* To remove duplicate rows based on duplication of values in all columns  
  `df.drop_duplicates()`  

* To remove rows that have duplicate entries in a specified column  
  `df.drop_duplicates(subset = ['Make'])`  

* To remove rows that have duplicate entries in multiple columns  
  `df.drop_duplicates(subset = ['Make', 'Model'])`

* Remove duplicate rows keeping the last instance rather than the first (default):  
  `df.drop_duplicates(keep='last')`

### Exercise 6 - Removing duplicate entries
---

remove duplicate `area` entries keeping first instance  

**Test output**:  
 Dataframe now contains 50 rows all with date 1999-12-*01*

In [17]:
import pandas as pd
url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
df = pd.read_csv(url)

df.drop_duplicates (subset = ["area"])

,code,area,date,median_salary,life_satisfaction,mean_salary,recycling_pct,population_size,number_of_jobs,area_size,no_of_houses,borough_flag
0,E09000001,city of london,1999-12-01,33020.0,NaN,48922,0,6581.0,NaN,NaN,NaN,1
1,E09000002,barking and dagenham,1999-12-01,21480.0,NaN,23620,3,162444.0,NaN,NaN,NaN,1
2,E09000003,barnet,1999-12-01,19568.0,NaN,23128,8,313469.0,NaN,NaN,NaN,1
3,E09000004,bexley,1999-12-01,18621.0,NaN,21386,18,217458.0,NaN,NaN,NaN,1
4,E09000005,brent,1999-12-01,18532.0,NaN,20911,6,260317.0,NaN,NaN,NaN,1
5,E09000006,bromley,1999-12-01,16720.0,NaN,21293,13,294902.0,NaN,NaN,NaN,1
6,E09000007,camden,1999-12-01,23677.0,NaN,30249,13,190003.0,NaN,NaN,NaN,1
7,E09000008,croydon,1999-12-01,19563.0,NaN,22205,13,332066.0,NaN,NaN,NaN,1
8,E09000009,ealing,1999-12-01,20580.0,NaN,25046,12,302252.0,NaN,NaN,NaN,1
9,E09000010,enfield,1999-12-01,19289.0,NaN,21006,9,272731.0,NaN,NaN,NaN,1
10,E09000011,greenwich,1999-12-01,21236.0,NaN,22263,4,212168.0,NaN,NaN,NaN,1
11,E09000012,hackney,1999-12-01,23249.0,NaN,39629,2,199087.0,NaN,NaN,NaN,1
12,E09000013,hammersmith and fulham,1999-12-01,25000.0,NaN,28555,7,160634.0,NaN,NaN,NaN,1
13,E09000014,haringey,1999-12-01,18783.0,NaN,21683,5,218559.0,NaN,NaN,NaN,1
14,E09000015,harrow,1999-12-01,20596.0,NaN,22824,10,207909.0,NaN,NaN,NaN,1
15,E09000016,havering,1999-12-01,17165.0,NaN,18786,8,225712.0,NaN,NaN,NaN,1
16,E09000017,hillingdon,1999-12-01,24002.0,NaN,28854,11,245053.0,NaN,NaN,NaN,1
17,E09000018,hounslow,1999-12-01,20155.0,NaN,24602,14,214298.0,NaN,NaN,NaN,1
18,E09000019,islington,1999-12-01,25113.0,NaN,34180,2,175717.0,NaN,NaN,NaN,1
19,E09000020,kensington and chelsea,1999-12-01,20646.0,NaN,28074,13,147678.0,NaN,NaN,NaN,1
20,E09000021,kingston upon thames,1999-12-01,19302.0,NaN,22967,18,146003.0,NaN,NaN,NaN,1
21,E09000022,lambeth,1999-12-01,23151.0,NaN,27930,8,266817.0,NaN,NaN,NaN,1
22,E09000023,lewisham,1999-12-01,20580.0,NaN,23283,4,250310.0,NaN,NaN,NaN,1
23,E09000024,merton,1999-12-01,18962.0,NaN,21867,11,185062.0,NaN,NaN,NaN,1
24,E09000025,newham,1999-12-01,18862.0,NaN,20580,3,240517.0,NaN,NaN,NaN,1
25,E09000026,redbridge,1999-12-01,19580.0,NaN,22087,8,238138.0,NaN,NaN,NaN,1
26,E09000027,richmond upon thames,1999-12-01,22321.0,NaN,25832,na,172782.0,NaN,NaN,NaN,1
27,E09000028,southwark,1999-12-01,22784.0,NaN,26994,3,247853.0,NaN,NaN,NaN,1
28,E09000029,sutton,1999-12-01,19582.0,NaN,22725,27,179375.0,NaN,NaN,NaN,1
29,E09000030,tower hamlets,1999-12-01,26376.0,NaN,37524,3,193507.0,NaN,NaN,NaN,1
30,E09000031,waltham forest,1999-12-01,18547.0,NaN,19888,9,221057.0,NaN,NaN,NaN,1
31,E09000032,wandsworth,1999-12-01,21321.0,NaN,24707,7,264220.0,NaN,NaN,NaN,1
32,E09000033,westminster,1999-12-01,24447.0,NaN,36167,7,189233.0,NaN,NaN,NaN,1
33,E12000001,north east,1999-12-01,16282.0,NaN,18351,5,2550314.0,NaN,NaN,NaN,0
34,E12000002,north west,1999-12-01,16977.0,NaN,19609,7,6773115.0,NaN,NaN,NaN,0
35,E12000003,yorkshire and the humber,1999-12-01,16527.0,NaN,18977,7,4956325.0,NaN,NaN,NaN,0
36,E12000004,east midlands,1999-12-01,16392.0,NaN,18864,11,4152443.0,NaN,NaN,NaN,0
37,E12000005,west midlands,1999-12-01,17000.0,NaN,19686,9,5271959.0,NaN,NaN,NaN,0
38,E12000006,east,1999-12-01,18000.0,NaN,20866,14,5338722.0,NaN,NaN,NaN,0
39,E12000007,london,1999-12-01,22487.0,NaN,29640,9,7153912.0,NaN,NaN,NaN,0
40,E12000008,south east,1999-12-01,18737.0,NaN,22361,15,7955124.0,NaN,NaN,NaN,0
41,E12000009,south west,1999-12-01,16727.0,NaN,19203,14,4880958.0,NaN,NaN,NaN,0
42,E13000001,inner london,1999-12-01,NaN,NaN,-,NaN,2750716.0,NaN,NaN,NaN,0
43,E13000002,outer london,1999-12-01,NaN,NaN,-,NaN,4403196.0,NaN,NaN,NaN,0
44,E92000001,england,1999-12-01,17939.0,NaN,21561,10,49032872.0,NaN,NaN,NaN,0
45,K02000001,united kingdom,1999-12-01,17803.0,NaN,21314,NaN,58684427.0,NaN,NaN,NaN,0
46,K03000001,great britain,1999-12-01,17866.0,NaN,21379,NaN,57005421.0,NaN,NaN,NaN,0
47,K04000001,england and wales,1999-12-01,17974.0,NaN,21549,NaN,51933471.0,NaN,NaN,NaN,0
48,N92000002,northern ireland,1999-12-01,15798.0,NaN,19093,NaN,1679006.0,NaN,NaN,NaN,0
49,S92000003,scotland,1999-12-01,16914.0,NaN,19667,NaN,5071950.0,NaN,NaN,NaN,0
50,W92000004,wales,1999-12-01,16457.0,NaN,18486,NaN,2900599.0,NaN,NaN,NaN,0

# Normalising Data  
When we normalise data, we remodel a numeric column in a dataframe to be on a standard scale (e.g. 0 or 1).   

For example if we had a column of BMI scores, we could normalise that column so that all scores greater than or equal to 25 were recoded to the value 1 (bad) and all scores less than 25 were recoded to 0 (good).  

To normalise we need to:
*   write a function, with the dataframe as a parameter, which will look at each row in dataframe column and return either a value in the normalised scale (e.g. 0,1 or 1,2,3,4) depending on that value.

For example:  
```
def normalise_bmi(df):
  if df['bmi'] >= 25:
    return 1
  else:
    return 0

df["bmi"] = df.apply(normalise_bmi, axis=1)
```
This code reassigns the values in the column "bmi" by sending each row one after the other to the normalise_bmi function, which will check the value in the "bmi" column and return either 0 or 1 depending on the value in the "bmi" column.

### Exercise 7 - normalise data set
---

Create a function called **normalise_income(df)** that will return the values 1, 2 or 3 to represent low income, middle income and high income.  If the value in `df['median_salary']` is less than 27441 (the median), return 1, otherwise if it is less than 30932 (the upper quartile) return 2 and otherwise return 3.

Apply the normalise_income(df) function to the `median_salary` column.

*NOTE:  this operation will change the original dataframe so if you run it twice, everything in the median_salary column will change to 1 (as it had already been reduced to 1, 2 or 3 - if this happens, run the code in Exercise 4 again to get the original data again from the file.*

**Test output**:  
The maximum value of the column df['median_salary'] will be 3 and the minimum value will be 1

In [19]:
import pandas as pd
url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
df = pd.read_csv(url)

def normalise_income(df):
  if df["median_salary"] <= 27441:
    return 1
  elif df ["median_salary"] <= 30932:
    return 2
  else:
    return 3

df ["median_salary"] = df.apply (normalise_income, axis=1)
print (df["median_salary"])

0       3
1       1
2       1
3       1
4       1
       ..
1066    2
1067    2
1068    1
1069    2
1070    2
Name: median_salary, Length: 1071, dtype: int64

### Exercise 8 - normalise the number of jobs column
---

Using what you have learnt from Exercise 7:  
*  use `df.describe()` to find the median, upper quartile and maximum for the number_of_jobs column  
*  create a function called **normalise_jobs(df)** that will return 1 if the `number_of_jobs` is below the median, 2 if the `number_of_jobs` is below the upper quartile or 3 otherwise.
*  normalise the `number_of_jobs` column by applying the function `normalise_jobs`.

**Test output**:  
The maximum value of the column df['number_of_jobs'] will be 3 and the minimum value will be 1

In [25]:
import pandas as pd
url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
df = pd.read_csv(url)

df.describe()

def normalise_jobsNo (df):
  if df ["number_of_jobs"] <= 3188000:
    return 1
  elif df ["number_of_jobs"] <= 22170000:
    return 2
  else:
    return 3
df ["number_of_jobs"] = df.apply (normalise_jobsNo, axis=1)
print (df ["number_of_jobs"])

print (df ["number_of_jobs"].max(), df ["number_of_jobs"].min())

0       3
1       3
2       3
3       3
4       3
       ..
1066    3
1067    3
1068    3
1069    3
1070    3
Name: number_of_jobs, Length: 1071, dtype: int64
3 1

## Exercise 9 - normalise into a new column
---

Create a new function and code to normalise the `no_of_houses` column BUT this time, instead of assigning the result to `df['no_of_houses']` assign it to a new column called `df['housing_volume']`

**Test output**:  
The maximum value of the column df['housing_volume'] will be 3 and the minimum value will be 1

In [29]:
import pandas as pd
url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
df = pd.read_csv(url)

df.describe()

def nornalize_houses (df):
  if df ["no_of_houses"] <= 8814000:
    return 1
  elif df ["no_of_houses"] <= 12620000:
    return 2
  else:
    return 3
df ["housing_volume"] = df.apply (normalise_jobsNo, axis=1)
print (df ["housing_volume"])

print (df ["housing_volume"].max(), df ["housing_volume"].min())

0       3
1       3
2       3
3       3
4       3
       ..
1066    3
1067    3
1068    3
1069    3
1070    3
Name: housing_volume, Length: 1071, dtype: int64
3 1
           code                      area        date  median_salary  \
1021  E09000002      barking and dagenham  2019-12-01        28738.0
1022  E09000003                    barnet  2019-12-01        31624.0
1023  E09000004                    bexley  2019-12-01        31642.0
1024  E09000005                     brent  2019-12-01        31739.0
1025  E09000006                   bromley  2019-12-01            NaN
1026  E09000007                    camden  2019-12-01        40196.0
1027  E09000008                   croydon  2019-12-01        35237.0
1028  E09000009                    ealing  2019-12-01        31021.0
1029  E09000010                   enfield  2019-12-01        28258.0
1030  E09000011                 greenwich  2019-12-01        33081.0
1031  E09000012                   hackney  2019-12-01        35020.0
1032  E09000013    hammersmith and fulham  2019-12-01        37990.0
1033  E09000014                  haringey  2019-12-01        30452.0
1034  E09000015                    harrow  2019-12-01        32809.0
1035  E09000016                  havering  2019-12-01        32321.0
1036  E09000017                hillingdon  2019-12-01        35231.0
1037  E09000018                  hounslow  2019-12-01        36487.0
1038  E09000019                 islington  2019-12-01        41076.0
1039  E09000020    kensington and chelsea  2019-12-01        33000.0
1040  E09000021      kingston upon thames  2019-12-01        32138.0
1041  E09000022                   lambeth  2019-12-01        36825.0
1042  E09000023                  lewisham  2019-12-01        32334.0
1043  E09000024                    merton  2019-12-01        31699.0
1044  E09000025                    newham  2019-12-01        33944.0
1045  E09000026                 redbridge  2019-12-01        29108.0
1046  E09000027      richmond upon thames  2019-12-01        35191.0
1047  E09000028                 southwark  2019-12-01        40303.0
1048  E09000029                    sutton  2019-12-01        32947.0
1049  E09000030             tower hamlets  2019-12-01        46142.0
1050  E09000031            waltham forest  2019-12-01        30718.0
1051  E09000032                wandsworth  2019-12-01        34168.0
1052  E09000033               westminster  2019-12-01        43556.0
1053  E12000001                north east  2019-12-01        27187.0
1054  E12000002                north west  2019-12-01        28137.0
1055  E12000003  yorkshire and the humber  2019-12-01        27835.0
1056  E12000004             east midlands  2019-12-01        28000.0
1057  E12000005             west midlands  2019-12-01        28536.0
1058  E12000006                      east  2019-12-01        30345.0
1059  E12000007                    london  2019-12-01        38992.0
1060  E12000008                south east  2019-12-01        32120.0
1061  E12000009                south west  2019-12-01        28654.0
1062  E13000001              inner london  2019-12-01            NaN
1063  E13000002              outer london  2019-12-01            NaN
1064  E92000001                   england  2019-12-01        30667.0
1065  K02000001            united kingdom  2019-12-01        30353.0
1066  K03000001             great britain  2019-12-01        30446.0
1067  K04000001         england and wales  2019-12-01        30500.0
1068  N92000002          northern ireland  2019-12-01        27434.0
1069  S92000003                  scotland  2019-12-01        30000.0
1070  W92000004                     wales  2019-12-01        27500.0

      life_satisfaction mean_salary recycling_pct  population_size  \
1021                NaN       32010           NaN              NaN
1022                NaN       37328           NaN              NaN
1023                NaN       33978           NaN              NaN
1024                NaN       36816           NaN              NaN
1025                NaN       37564           NaN              NaN
1026                NaN       49115           NaN              NaN
1027                NaN       38363           NaN              NaN
1028                NaN       36420           NaN              NaN
1029                NaN       36320           NaN              NaN
1030                NaN       36425           NaN              NaN
1031                NaN       42067           NaN              NaN
1032                NaN       48362           NaN              NaN
1033                NaN       35251           NaN              NaN
1034                NaN       37172           NaN              NaN
1035                NaN       37161           NaN              NaN
1036                NaN       41686           NaN              NaN
1037                NaN       50418           NaN              NaN
1038                NaN       53466           NaN              NaN
1039                NaN       41741           NaN              NaN
1040                NaN       37666           NaN              NaN
1041                NaN       48004           NaN              NaN
1042                NaN       36036           NaN              NaN
1043                NaN           #           NaN              NaN
1044                NaN       41592           NaN              NaN
1045                NaN       34096           NaN              NaN
1046                NaN       42092           NaN              NaN
1047                NaN       47811           NaN              NaN
1048                NaN       37392           NaN              NaN
1049                NaN       69434           NaN              NaN
1050                NaN       33119           NaN              NaN
1051                NaN       39617           NaN              NaN
1052                NaN       60010           NaN              NaN
1053                NaN       31852           NaN              NaN
1054                NaN       33479           NaN              NaN
1055                NaN       32653           NaN              NaN
1056                NaN       32639           NaN              NaN
1057                NaN       34247           NaN              NaN
1058                NaN       36143           NaN              NaN
1059                NaN       53100           NaN              NaN
1060                NaN       38715           NaN              NaN
1061                NaN       33543           NaN              NaN
1062                NaN       59987           NaN              NaN
1063                NaN       38614           NaN              NaN
1064                NaN       38206           NaN              NaN
1065                NaN       37428           NaN              NaN
1066                NaN       37603           NaN              NaN
1067                NaN       37865           NaN              NaN
1068                NaN       32083           NaN              NaN
1069                NaN       34916           NaN              NaN
1070                NaN       31251           NaN              NaN

      number_of_jobs  area_size  no_of_houses  borough_flag  housing_volume
1021             NaN        NaN           NaN             1               3
1022             NaN        NaN           NaN             1               3
1023             NaN        NaN           NaN             1               3
1024             NaN        NaN           NaN             1               3
1025             NaN        NaN           NaN             1               3
1026             NaN        NaN           NaN             1               3
1027             NaN        NaN           NaN             1               3
1028             NaN        NaN           NaN             1               3
1029             NaN        NaN           NaN             1               3
1030             NaN        NaN           NaN             1               3
1031             NaN        NaN           NaN             1               3
1032             NaN        NaN           NaN             1               3
1033             NaN        NaN           NaN             1               3
1034             NaN        NaN           NaN             1               3
1035             NaN        NaN           NaN             1               3
1036             NaN        NaN           NaN             1               3
1037             NaN        NaN           NaN             1               3
1038             NaN        NaN           NaN             1               3
1039             NaN        NaN           NaN             1               3
1040             NaN        NaN           NaN             1               3
1041             NaN        NaN           NaN             1               3
1042             NaN        NaN           NaN             1               3
1043             NaN        NaN           NaN             1               3
1044             NaN        NaN           NaN             1               3
1045             NaN        NaN           NaN             1               3
1046             NaN        NaN           NaN             1               3
1047             NaN        NaN           NaN             1               3
1048             NaN        NaN           NaN             1               3
1049             NaN        NaN           NaN             1               3
1050             NaN        NaN           NaN             1               3
1051             NaN        NaN           NaN             1               3
1052             NaN        NaN           NaN             1               3
1053             NaN        NaN           NaN             0               3
1054             NaN        NaN           NaN             0               3
1055             NaN        NaN           NaN             0               3
1056             NaN        NaN           NaN             0               3
1057             NaN        NaN           NaN             0               3
1058             NaN        NaN           NaN             0               3
1059             NaN        NaN           NaN             0               3
1060             NaN        NaN           NaN             0               3
1061             NaN        NaN           NaN             0               3
1062             NaN        NaN           NaN             0               3
1063             NaN        NaN           NaN             0               3
1064             NaN        NaN           NaN             0               3
1065             NaN        NaN           NaN             0               3
1066             NaN        NaN           NaN             0               3
1067             NaN        NaN           NaN             0               3
1068             NaN        NaN           NaN             0               3
1069             NaN        NaN           NaN             0               3
1070             NaN        NaN           NaN             0               3

### Exercise 10 - normalise boroughs
---

Normalise the `area_size` column so that all values below mean are represented as 0 and otherwise are 1.  Assign the output to a new column called `area_size_normalised`.  

**Test output**:  
`area_size_normalised` column will contain both 0s and 1s.  The position of the first row with value 1 will be 0 and the position of the first row with value 0 will be 102.

In [4]:
import pandas as pd
url = "https://raw.githubusercontent.com/futureCodersSE/working-with-data/main/Data%20sets/housing_in_london_yearly_variables.csv"
df = pd.read_csv(url)

df.describe()
df.dropna (subset = ["area_size"])

def normalize_area (df):
  if df ["area_size"] <= 3724000:
    return 0
  else:
    return 1
df ["area_size_normalised"] = df.apply (normalize_area, axis = 1)

print (df.head (10))

        code                  area        date  median_salary  \
0  E09000001        city of london  1999-12-01        33020.0
1  E09000002  barking and dagenham  1999-12-01        21480.0
2  E09000003                barnet  1999-12-01        19568.0
3  E09000004                bexley  1999-12-01        18621.0
4  E09000005                 brent  1999-12-01        18532.0
5  E09000006               bromley  1999-12-01        16720.0
6  E09000007                camden  1999-12-01        23677.0
7  E09000008               croydon  1999-12-01        19563.0
8  E09000009                ealing  1999-12-01        20580.0
9  E09000010               enfield  1999-12-01        19289.0

   life_satisfaction mean_salary recycling_pct  population_size  \
0                NaN       48922             0           6581.0
1                NaN       23620             3         162444.0
2                NaN       23128             8         313469.0
3                NaN       21386            18         217458.0
4                NaN       20911             6         260317.0
5                NaN       21293            13         294902.0
6                NaN       30249            13         190003.0
7                NaN       22205            13         332066.0
8                NaN       25046            12         302252.0
9                NaN       21006             9         272731.0

   number_of_jobs  area_size  no_of_houses  borough_flag  area_size_normalised
0             NaN        NaN           NaN             1                     1
1             NaN        NaN           NaN             1                     1
2             NaN        NaN           NaN             1                     1
3             NaN        NaN           NaN             1                     1
4             NaN        NaN           NaN             1                     1
5             NaN        NaN           NaN             1                     1
6             NaN        NaN           NaN             1                     1
7             NaN        NaN           NaN             1                     1
8             NaN        NaN           NaN             1                     1
9             NaN        NaN           NaN             1                     1